Revit 2027 API
UV.BasisU Property
The basis of the U axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static UV BasisU { get; }
Public Shared ReadOnly Property BasisU As UV
	Get
public:
static property UV^ BasisU {
	UV^ get ();
}
static member BasisU : UV with get
Property Value
UV
Remarks
The basis of the U axis is the vector (1,0), the unit vector on the U axis.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace